<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"></ul></div>

In [1]:
import pandas as pd
import numpy as np


import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

from sklearn.model_selection import train_test_split
from sklearn.impute import SimpleImputer
from sklearn.preprocessing import LabelEncoder, OneHotEncoder, MinMaxScaler

# ignore warnings
import warnings
warnings.filterwarnings("ignore")

import acquire_walkthrough
import prepare_walkthrough

In [2]:
iris_df = acquire_walkthrough.get_iris_data()
iris_df.head(3)

,species_id,species_name,sepal_length,sepal_width,petal_length,petal_width
0,1,setosa,5.1,3.5,1.4,0.2
1,1,setosa,4.9,3.0,1.4,0.2
2,1,setosa,4.7,3.2,1.3,0.2

In [3]:
le, train, test = prepare_walkthrough.prep_iris(iris_df)

In [4]:
le

LabelEncoder()

In [5]:
train.head()

     species  sepal_length  sepal_width  petal_length  petal_width
30         0           4.8          3.1           1.6          0.2
36         0           5.5          3.5           1.3          0.2
29         0           4.7          3.2           1.6          0.2
55         1           5.7          2.8           4.5          1.3
118        2           7.7          2.6           6.9          2.3

In [6]:
test.head(1)

     species  sepal_length  sepal_width  petal_length  petal_width
135        2           7.7          3.0           6.1          2.3

In [7]:
train, test = prepare_walkthrough.inverse_encode(train, test, le)

In [8]:
train.head()

        species  sepal_length  sepal_width  petal_length  petal_width
30       setosa           4.8          3.1           1.6          0.2
36       setosa           5.5          3.5           1.3          0.2
29       setosa           4.7          3.2           1.6          0.2
55   versicolor           5.7          2.8           4.5          1.3
118   virginica           7.7          2.6           6.9          2.3

In [9]:
test.head(1)

       species  sepal_length  sepal_width  petal_length  petal_width
135  virginica           7.7          3.0           6.1          2.3

In [10]:
titanic_df = acquire_walkthrough.get_titanic_data()
titanic_df.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,None,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,None,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,None,Southampton,1

In [11]:
scaler, ohe, train, test = prepare_walkthrough.prep_titanic(titanic_df)

In [12]:
scaler

MinMaxScaler(copy=True, feature_range=(0, 1))

In [13]:
ohe

OneHotEncoder(categorical_features=None, categories='auto', drop=None,
              dtype=<class 'numpy.float64'>, handle_unknown='error',
              n_values=None, sparse=False)

In [14]:
train.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,embark_town,alone,C,Q,S
683,683,0,3,male,0.184561,5,2,0.091543,S,Third,Southampton,0,0.0,0.0,1.0
421,421,0,3,male,0.279696,0,0,0.015094,Q,Third,Queenstown,1,0.0,1.0,0.0
336,336,0,1,male,0.388421,1,0,0.129995,S,First,Southampton,0,0.0,0.0,1.0
681,681,1,1,male,0.361239,0,0,0.149765,C,First,Cherbourg,1,1.0,0.0,0.0
610,610,0,3,female,0.524327,1,5,0.061045,S,Third,Southampton,0,0.0,0.0,1.0

In [15]:
test.head(1)

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,embark_town,alone,C,Q,S
114,114,0,3,female,0.225333,0,0,0.028221,C,Third,Cherbourg,1,1.0,0.0,0.0